---
kind: other
id: Methods.T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular
source: html/469f9c48-6a49-4302-1fb2-515604d603ad.htm
---
# StructuralSectionRectangular Methods

Returns size of the section boundary.